{
  "modelTopology": {
    "class_name": "Sequential",
    "config": [
      {
        "class_name": "Conv2D",
        "config": {
          "filters": 32,
          "kernel_size": [3, 3],
          "activation": "relu",
          "input_shape": [224, 224, 3]
        }
      },
      {
        "class_name": "MaxPooling2D",
        "config": {
          "pool_size": [2, 2]
        }
      },
      // Add other layers as needed
    ],
    "backend": "tensorflow"
  },
  "weightsManifest": [
    {
      "paths": ["weights.bin"], // Adjust the name if necessary
      "weights": [
        "conv2d/kernel",
        "conv2d/bias"
        // List all weight names as generated during training
      ]
    }
  ]
}
